[
    {
        "id": 1,
        "title": "REAL-TIME COLLAB TOOL",
        "subtitle": "DEPLOYED",
        "location": "GLOBAL",
        "challenge": "REAL-TIME SYNC",
        "service": "FULL STACK",
        "industry": "PRODUCTIVITY",
        "year": "2024",
        "color": "#1a3a52",
        "image": "/collab_thumbnail.png",
        "overview": "The Real-Time Collaboration Tool is a full-stack web application designed to enable remote teams to collaborate synchronously on shared documents. Inspired by platforms like Google Docs, the system supports real-time document editing, live chat, presence awareness, and communication features, all powered by WebSockets.\n\nThe platform is built using Next.js with TypeScript on the frontend and a Node.js + Express backend, with Socket.IO enabling real-time interactions across users.",
        "solution": "I designed and developed a real-time collaboration platform where multiple users can edit documents simultaneously while seeing live updates, cursor positions, and user presence. The system uses Socket.IO for real-time synchronization, JWT-based authentication for security, and a rich-text editor for collaborative document creation. The architecture is scalable and modular, allowing future extensions like screen sharing and advanced analytics.",
        "techStack": [
            "Next.js 14",
            "TypeScript",
            "Node.js",
            "Express",
            "Socket.IO",
            "MongoDB",
            "Chakra UI",
            "WebRTC"
        ],
        "features": [
            "Real-Time Document Editing",
            "Live Cursor Tracking",
            "Integrated Text Chat",
            "Video & Audio Calls",
            "Presence Indicators (Online/Offline)",
            "Secure JWT Authentication",
            "Workspace Management"
        ],
        "link": "https://collab-frontend-one.vercel.app/"
    },
    {
        "id": 2,
        "title": "RESUME BUILDER",
        "subtitle": "DEPLOYED",
        "location": "GLOBAL",
        "challenge": "USER EXPERIENCE",
        "service": "WEB APPLICATION",
        "industry": "UTILITY",
        "year": "2024",
        "color": "#ff5722",
        "image": "/resume_builder_thumbnail.png",
        "overview": "Resume Builder is a modern, feature-rich web application that allows users to create, customize, and export professional resumes through an intuitive, real-time interface. The platform is designed to simplify resume creation while giving users full control over layout, styling, and content.\n\nBuilt using React and TypeScript, the application offers drag-and-drop section management, live preview, customizable themes, and a multi-page architecture including landing, templates, builder, and dashboard views.",
        "solution": "I developed a React + TypeScript resume builder that uses a 3-column editor layout to separate structure, content editing, and preview. The application provides instant visual feedback, allowing users to design resumes interactively while maintaining professional formatting standards. The system emphasizes strong typing, modular architecture, and scalable UI design.",
        "techStack": [
            "React 19.2",
            "TypeScript",
            "Vite",
            "Chakra UI v3",
            "React Router",
            "@dnd-kit",
            "React Hook Form",
            "Zod"
        ],
        "features": [
            "Drag & Drop Section Reordering",
            "Real-Time Resume Preview",
            "Custom Themes & Typography",
            "Modular Resume Sections",
            "Multi-Page Architecture",
            "Professional Layout Standards",
            "Export to PDF"
        ],
        "link": "https://resumebuilder.gauravpawar.in/"
    },
    {
        "id": 3,
        "title": "WHITE LOTUS HOSPITAL",
        "subtitle": "WEB • DEPLOYED",
        "location": "INDIA",
        "challenge": "CUSTOM CMS & WEBSITE",
        "service": "WEB DEVELOPMENT",
        "industry": "HEALTHCARE",
        "year": "2024",
        "color": "#2a2a2a",
        "image": "/white_lotus.png",
        "overview": "White Lotus Hospital is a healthcare organization based in Navi Mumbai that required a modern, trustworthy digital presence along with a content management system that allows their internal team to manage website content independently.\n\nI developed a fully responsive hospital website along with a custom-built CMS using React.js, enabling complete control over content updates without technical dependency.",
        "solution": "I built a modern React-based website supported by a custom React CMS, connected through API integration. The system allows hospital staff to manage pages, services, and content dynamically while ensuring a consistent experience across desktop and mobile devices.",
        "techStack": [
            "React.js",
            "Tailwind CSS",
            "Custom React CMS",
            "REST APIs"
        ],
        "features": [
            "Responsive Hospital Website",
            "Custom CMS Dashboard",
            "Mobile-Responsive CMS",
            "Real-time API Integration",
            "Scalable Architecture"
        ],
        "link": "https://whitelotushospital.com/"
    },
    {
        "id": 4,
        "title": "PATEL R MART",
        "subtitle": "APP • DEPLOYED",
        "location": "INDIA",
        "challenge": "E-COMMERCE",
        "service": "MOBILE APP",
        "industry": "RETAIL",
        "year": "2024",
        "color": "#4caf50",
        "image": "/patelrmart_thumbnail.jpg",
        "overview": "Local retail stores needed a digital shopping solution to reduce dependency on physical visits and support home delivery.\n\nThe app had to be simple, fast, and scalable, while working smoothly on both Android and iOS.",
        "solution": "A cross-platform mobile application built using Flutter that delivers a smooth grocery shopping experience with intuitive navigation, responsive layouts, and production-ready performance.",
        "techStack": [
            "Flutter",
            "Dart",
            "REST API",
            "Material UI"
        ],
        "features": [
            "Product Browsing",
            "Smart Cart Management",
            "Seamless Order Placement",
            "Promotional Banners",
            "Responsive UI",
            "Unified Android & iOS Experience"
        ],
        "link": "https://play.google.com/store/apps/details?id=com.patelrmart.app"
    },
    {
        "id": 5,
        "title": "PRASAD FOOD DIVINE",
        "subtitle": "APP • DEPLOYED",
        "location": "INDIA",
        "challenge": "FOOD DELIVERY",
        "service": "APP DEVELOPMENT",
        "industry": "FOOD & BEVERAGE",
        "year": "2024",
        "color": "#ff9800",
        "image": "/prasad_food.jpg",
        "overview": "Prasad Food Divine is a food ordering and delivery mobile application developed using Flutter, designed to help users easily browse food items, place orders, and receive updates in real time.\n\nThe app is powered by a Node.js backend and uses Firebase Cloud Messaging (FCM) for push notifications, enabling smooth communication between the system and users.",
        "solution": "I developed a Flutter-based mobile application supported by a Node.js backend, integrated with Firebase FCM push notifications to provide real-time order updates. The app delivers a smooth user experience while ensuring timely communication and efficient order flow.",
        "techStack": [
            "Flutter",
            "Dart",
            "Node.js",
            "Firebase FCM",
            "REST APIs"
        ],
        "features": [
            "Food Menu Browsing",
            "Order Placement Flow",
            "Push Notifications (FCM)",
            "Responsive UI",
            "API Integration",
            "Performance-Focused UI"
        ],
        "link": "https://play.google.com/store/apps/details?id=com.hotel_oms.trijap"
    },
    {
        "id": 6,
        "title": "TRACZI",
        "subtitle": "GPS TRACKING • FLEET MANAGEMENT",
        "location": "GLOBAL",
        "challenge": "REAL-TIME TRACKING",
        "service": "WEB & MOBILE APP",
        "industry": "LOGISTICS",
        "year": "2024",
        "color": "#9c27b0",
        "image": "/traczi.png",
        "overview": "Traczi is a GPS tracking and monitoring application developed on top of Traccar, designed to provide real-time location tracking, vehicle monitoring, and activity insights. The system enables users to track assets, vehicles, or devices live on a map with accurate telemetry data.\n\nThe application focuses on reliability, real-time updates, and practical usability for logistics, fleet management, and asset tracking use cases.",
        "solution": "I designed and implemented the Traczi application layer using the Traccar backend engine. The system consumes Traccar APIs to display real-time positions, track movement history, and monitor devices efficiently. I implemented live map tracking, history views, and optimized data refresh for real-time performance, creating a centralized solution for fleet visibility.",
        "techStack": [
            "Traccar Engine",
            "REST APIs",
            "Google Maps / OSM",
            "WebSockets",
            "React",
            "Mobile"
        ],
        "features": [
            "Real-Time Live Tracking",
            "Route & History Playback",
            "Vehicle & Asset Management",
            "Live Status Monitoring",
            "Event & Alert System",
            "Geofencing Support"
        ]
    },
    {
        "id": 7,
        "title": "DISHA MARG",
        "subtitle": "DEPLOYED",
        "location": "INDIA",
        "challenge": "GUIDANCE PLATFORM",
        "service": "WEB PLATFORM",
        "industry": "EDUCATION",
        "year": "2024",
        "color": "#607d8b",
        "image": "/dishamarg_thumbnail.png",
        "overview": "DishaMarg is an AI-powered career navigation web platform designed to help users make informed career decisions using intelligent analysis and personalized guidance. The platform leverages Google Gemini AI to analyze skill gaps, generate learning paths, build optimized resumes, and provide real-time career mentoring through an interactive AI assistant.\n\nThe application is deployed on a live subdomain and built as a feature-rich, future-ready platform focused on career growth and upskilling.",
        "solution": "I developed DishaMarg, a web-based AI career guidance platform that combines multiple career tools into one seamless experience. Using Gemini AI, the platform analyzes user input to provide personalized recommendations, learning paths, resume improvements, and job suggestions. The system focuses on usability, personalization, and intelligent automation to empower users in their career journey.",
        "techStack": [
            "HTML5",
            "JavaScript",
            "Tailwind CSS",
            "Google Gemini API",
            "Three.js",
            "Web Speech API",
            "jsPDF"
        ],
        "features": [
            "AI Skill Gap Analyzer",
            "Learning Path Generator",
            "AI Resume Builder",
            "3D Interactive AI Mentor",
            "Job Matching Module",
            "Voice & Text Interaction",
            "Export to PDF/DOCX"
        ],
        "link": "https://dishamarg.gauravpawar.in"
    },
    {
        "id": 8,
        "title": "ECOMMERCE BACKEND",
        "subtitle": "DEPLOYED",
        "location": "GLOBAL",
        "challenge": "SCALABLE API",
        "service": "BACKEND DEV",
        "industry": "E-COMMERCE",
        "year": "2024",
        "color": "#3f51b5",
        "image": "/ecomm_backend.png",
        "overview": "Patel E-commerce Backend is a production-grade RESTful API system built to power a full-scale e-commerce platform. The backend supports authentication, product catalog, cart, orders, payments, notifications, admin operations, and content management.\n\nTo improve developer experience, onboarding speed, and long-term maintainability, I implemented comprehensive Swagger/OpenAPI 3.0 documentation covering 100+ API endpoints, making the entire backend self-documented, testable, and standards-compliant.",
        "solution": "I implemented Swagger (OpenAPI 3.0) documentation across the entire backend using swagger-jsdoc and swagger-ui-express. The solution automatically generates interactive API documentation from structured JSDoc comments, enabling live API testing from the browser, clear request/response schemas, authentication-aware endpoint testing, and logical grouping of APIs using tags.",
        "techStack": [
            "Node.js",
            "Express.js",
            "Swagger UI",
            "OpenAPI 3.0",
            "JWT",
            "Razorpay"
        ],
        "features": [
            "100+ Endpoints Documented",
            "29+ API Categories",
            "JWT Authentication",
            "Interactive API Testing",
            "Reusable Schema Definitions",
            "Admin & User APIs",
            "Exportable OpenAPI Spec"
        ],
        "link": "https://ecommerceapi-web.onrender.com/api-docs/#/"
    },
    {
        "id": 9,
        "title": "GO GREEN BIN GO BACKEND",
        "subtitle": "DEPLOYED",
        "location": "INDIA",
        "challenge": "WASTE MGMT",
        "service": "BACKEND DEV",
        "industry": "SUSTAINABILITY",
        "year": "2024",
        "color": "#009688",
        "image": "/gogreenbingo.png",
        "overview": "Go Green Bin Go is a smart waste management platform designed to modernize garbage collection and civic engagement using real-time data. The backend powers services such as bin fill-level detection, optimized collection routing, litter detection, notifications, citizen engagement, and administrative operations.\n\nThe backend API is fully documented with Swagger/OpenAPI, providing interactive and organized documentation for fast onboarding, reliable API contracts, and seamless integration by frontend and mobile teams.",
        "solution": "I built a scalable Node.js backend API for Go Green Bin Go with complete Swagger/OpenAPI documentation, enabling interactive API testing directly in the browser, clear data models and request/response contracts, organized categories for fast navigation, and secure and standardized endpoint definitions.",
        "techStack": [
            "Node.js",
            "Express.js",
            "Swagger UI",
            "OpenAPI 3.0",
            "MongoDB",
            "JWT"
        ],
        "features": [
            "Swagger API Documentation",
            "Endpoint Categorization",
            "Secure Routes (JWT)",
            "Interactive Testing",
            "Real-Time Waste Data APIs",
            "Route Optimization",
            "Analytics & Dashboards"
        ],
        "link": "https://go-green-bin-go-api.onrender.com/api-docs/#/"
    }
]